internetAnalytics.org
#+TITLE: COM-308: Internet Analytics
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/raph/school/theme.css"/>
#+OPTIONS: toc:2, H:4
# Local Variables:
# org-download-image-dir: \./files
# End:

* Grading

- Project 20%
- Midterm 30%
- Final   50%

* Lecture 1
* Lecture 2

For *networks* we use models, can't be exactly accurate (would be too complicated), but can
still be useful to understand.

** What are models for
*** Explanation of phenomenon/behavior/pattern

- Occam's razor = simplest possible model preferred
- Uses most important features of the system
- E.g. economics - income distribution

*** Prediction and inference

- Favor performance, not parsimony
- Can be black-box
- E.g. stock-price prediction for time series

** Social networks

- Captures ties between individuals
- Ties can be several things (friendship,business relationship,...)
- Tie formation:
  - Complex social process
  - Type and level of tie
- Most parsimonious model: "social network"
  - Graph
  - Undirected edges, without attributes or weights
  - Only structure
- Becoming really huge (more data)

** Information networks

- Web
- Assymetric links \Rightarrow directed graph

*** Examples

- Internet, traffic exchange arrangements (peering) w/o central coordination
- Wikipedia, references to related concepts
- Scientific literature, bibliography cites prior works
- Dictionary: explaining one term in terms of other terms

** Common features

- No rules or centralized design
- Nobody has global information (knowledge of "neighborhood" only)
- Element of chance (random models)

** Giant component

- Definition: Connected component that is:
  - Much larger than other connected components
  - Significant fraction of whole network (Same order of magnitude)
- The could be several very large components
- Finding GC:
  - Finding components: start at vertex $u$ and run BFS/DFS to exhaustion
  - Find dominant component

*** Random graphs ($G(n,p)$)

$G(n,p)$ model:
- $n$ vertices
- Every edge $(u,v)$ exists independently with prob $p$
Expected degree (# of neighbors) =  $c$ = $(n-1)p \sim np$

*** Giant component in $G(n,p)$

- Conditions for GC in $G(n,p)$
- As $n \to \infty$, what functions $p_n$ ensure that $P(G(n,p_n)$ has GC $\to
  1$
- Discovery process:
  - Start at a node $u$
  - Find $u$ 's neighbors recursively until done (BFS/DFS)
- Property of set of discovered nodes: only a function of edges and independent
  of other edges

**** Using Principle of Deferred Decision (PDD) for node discovery

Flip coin to choose next node (amongst connected and not already checked nodes)
- Three types of node:
  - Potential, could be in the component
  - Active, is in the component, edges not checked
  - saturated, in the component and edges already checked
- $k$ th step:
  - $A_k$: # active
  - $k$: # saturated (used)
  - $n-k-A_k$: # potential
- Number of new active nodes from old active node:
  - $X_k \sim \text{Binom}(n-k-A_k,p)$
  - Indep.
- Approximation: while $k$ and $A_k << n$: $\text{Binom}(n-k-A_k,p) \simeq
  \text{Binom}(n,p)$
- Termination: if E[# offspring] > 1; then P[termination] < 1; if E[# offspring]
  < 1, then P[termination] = 1

**** Condition for GC in $G(n,p)$

- Set $p=\frac{c}{n}$
  - $c$: average degree
  - Number of offspring $\sim$ Poisson($c$)
- Theorem:
  - if $c > 1$, then $G(n,p)$ has a single component of size $\Theta(n)$
    asymptotically almost surely; all other components are small (of size
    $o(n)$)
  - if $c < 1$, then $G(n,p)$ has only small components
- Interpretation:
  - Giant component emerges naturally, even with completely random edge
    generation
  - No network-wide “coordination” needed
  - Sharp threshold – phase transition! At avg degree c = 1
- Note:
  - More to prove: single component; impact of ignoring $k + A_k$
  - Below threshold (c < 1): all small components are trees

**** $G(n,p)$ model: connectivity

- Another phase transition: Consider threshold function $t(n) = \frac{\log n}{n}$
- Theorem:
  - If $p(n)/t(n) \to \infty$, then $G(n, p)$ is connected (a.a.s.)
  - If $p(n)/t(n) \to 0$, then $G(n, p)$ is not connected (a.a.s.)
  - Gap between these two \to harder to analyze
- Intuition: [[https://en.wikipedia.org/wiki/Coupon_collector's_problem][Coupon collector problem]]: $n \log n$ balls needed to have no empty
  bins

