internetAnalytics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-20 Mon 16:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>COM-308: Internet Analytics</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/home/raph/school/theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">COM-308: Internet Analytics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga40dd5d">1. Grading</a></li>
<li><a href="#orgd3f1888">2. Lecture 1</a></li>
<li><a href="#orgbbe0a6c">3. Lecture 2</a>
<ul>
<li><a href="#org351c1f4">3.1. What are models for</a></li>
<li><a href="#org17fefa9">3.2. Social networks</a></li>
<li><a href="#orgf4cb89b">3.3. Information networks</a></li>
<li><a href="#orgd3e697f">3.4. Common features</a></li>
<li><a href="#org1ac3bda">3.5. Giant component</a></li>
<li><a href="#orgd4c4917">3.6. Clustering</a></li>
<li><a href="#org883fcdd">3.7. Strong and weak ties</a></li>
<li><a href="#org361e6d2">3.8. Short paths</a></li>
</ul>
</li>
<li><a href="#org19c334e">4. Lecture 3</a>
<ul>
<li><a href="#orgf3b6055">4.1. Herding and "watching thy neighbor"</a></li>
<li><a href="#orgb06cc47">4.2. Watching thy Neighbor</a></li>
<li><a href="#orgbb69a61">4.3. Herding how it can go wrong? Urn model</a></li>
<li><a href="#orga078e9a">4.4. Herding in networks</a></li>
<li><a href="#org7ed2929">4.5. Preferential attachment in growing nets</a></li>
<li><a href="#org8530906">4.6. Observing</a></li>
</ul>
</li>
<li><a href="#org3c5c58c">5. Lecture 4</a>
<ul>
<li><a href="#org407c339">5.1. Node statistics in large networks</a></li>
<li><a href="#orgf127015">5.2. Random walks on graphs</a></li>
<li><a href="#orga148ca1">5.3. Epidemics</a></li>
</ul>
</li>
<li><a href="#org172dcec">6. Lecture 5</a>
<ul>
<li><a href="#orgb26ceea">6.1. Structure of the web</a></li>
<li><a href="#org6b8235a">6.2. Search &rarr; Ranking</a></li>
</ul>
</li>
<li><a href="#org5faf26e">7. Tips and tricks</a>
<ul>
<li><a href="#orgaf054f1">7.1. Stationary distribution of RW</a></li>
</ul>
</li>
<li><a href="#orgdc28593">8. Lab1</a>
<ul>
<li><a href="#orgc639100">8.1. </a></li>
<li><a href="#org07b6129">8.2. Finish lab 1</a></li>
</ul>
</li>
<li><a href="#orgc107e10">9. Research</a>
<ul>
<li><a href="#org986f827">9.1. Principle of deffered decision for giant component discovery</a></li>
<li><a href="#org4c5d72d">9.2. Unbiased estimator for Random Walks</a></li>
<li><a href="#org9dc2a6d">9.3. Mixing time for RW</a></li>
<li><a href="#org83cc3f8">9.4. Conductance</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga40dd5d" class="outline-2">
<h2 id="orga40dd5d"><span class="section-number-2">1</span> Grading</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Project 20%</li>
<li>Midterm 30%</li>
<li>Final   50%</li>
</ul>
</div>
</div>

<div id="outline-container-orgd3f1888" class="outline-2">
<h2 id="orgd3f1888"><span class="section-number-2">2</span> Lecture 1</h2>
</div>
<div id="outline-container-orgbbe0a6c" class="outline-2">
<h2 id="orgbbe0a6c"><span class="section-number-2">3</span> Lecture 2</h2>
<div class="outline-text-2" id="text-3">
<p>
For <b>networks</b> we use models, can't be exactly accurate (would be too complicated), but can
still be useful to understand.
</p>
</div>

<div id="outline-container-org351c1f4" class="outline-3">
<h3 id="org351c1f4"><span class="section-number-3">3.1</span> What are models for</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgc9a7d1b" class="outline-4">
<h4 id="orgc9a7d1b"><span class="section-number-4">3.1.1</span> Explanation of phenomenon/behavior/pattern</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Occam's razor = simplest possible model preferred</li>
<li>Uses most important features of the system</li>
<li>E.g. economics - income distribution</li>
</ul>
</div>
</div>

<div id="outline-container-org103fea4" class="outline-4">
<h4 id="org103fea4"><span class="section-number-4">3.1.2</span> Prediction and inference</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Favor performance, not parsimony</li>
<li>Can be black-box</li>
<li>E.g. stock-price prediction for time series</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org17fefa9" class="outline-3">
<h3 id="org17fefa9"><span class="section-number-3">3.2</span> Social networks</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Captures ties between individuals</li>
<li>Ties can be several things (friendship,business relationship,&#x2026;)</li>
<li>Tie formation:
<ul class="org-ul">
<li>Complex social process</li>
<li>Type and level of tie</li>
</ul></li>
<li>Most parsimonious model: "social network"
<ul class="org-ul">
<li>Graph</li>
<li>Undirected edges, without attributes or weights</li>
<li>Only structure</li>
</ul></li>
<li>Becoming really huge (more data)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf4cb89b" class="outline-3">
<h3 id="orgf4cb89b"><span class="section-number-3">3.3</span> Information networks</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Web</li>
<li>Assymetric links &rArr; directed graph</li>
</ul>
</div>

<div id="outline-container-org40679be" class="outline-4">
<h4 id="org40679be"><span class="section-number-4">3.3.1</span> Examples</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>Internet, traffic exchange arrangements (peering) w/o central coordination</li>
<li>Wikipedia, references to related concepts</li>
<li>Scientific literature, bibliography cites prior works</li>
<li>Dictionary: explaining one term in terms of other terms</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd3e697f" class="outline-3">
<h3 id="orgd3e697f"><span class="section-number-3">3.4</span> Common features</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>No rules or centralized design</li>
<li>Nobody has global information (knowledge of "neighborhood" only)</li>
<li>Element of chance (random models)</li>
</ul>
</div>
</div>

<div id="outline-container-org1ac3bda" class="outline-3">
<h3 id="org1ac3bda"><span class="section-number-3">3.5</span> Giant component</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Definition: Connected component that is:
<ul class="org-ul">
<li>Much larger than other connected components</li>
<li>Significant fraction of whole network (Same order of magnitude)</li>
</ul></li>
<li>The could be several very large components</li>
<li>Finding GC:
<ul class="org-ul">
<li>Finding components: start at vertex \(u\) and run BFS/DFS to exhaustion</li>
<li>Find dominant component</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org68b8301" class="outline-4">
<h4 id="org68b8301"><span class="section-number-4">3.5.1</span> Random graphs (\(G(n,p)\))</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
\(G(n,p)\) model:
</p>
<ul class="org-ul">
<li>\(n\) vertices</li>
<li>Every edge \((u,v)\) exists independently with prob \(p\)</li>
</ul>
<p>
Expected degree (# of neighbors) =  \(c\) = \((n-1)p \sim np\)
</p>
</div>
</div>

<div id="outline-container-orgafb669d" class="outline-4">
<h4 id="orgafb669d"><span class="section-number-4">3.5.2</span> Giant component in \(G(n,p)\)</h4>
<div class="outline-text-4" id="text-3-5-2">
<ul class="org-ul">
<li>Conditions for GC in \(G(n,p)\)</li>
<li>As \(n \to \infty\), what functions \(p_n\) ensure that \(P(G(n,p_n)\) has GC \(\to
  1\)</li>
<li>Discovery process:
<ul class="org-ul">
<li>Start at a node \(u\)</li>
<li>Find \(u\) 's neighbors recursively until done (BFS/DFS)</li>
</ul></li>
<li>Property of set of discovered nodes: only a function of edges and independent
of other edges</li>
</ul>
</div>

<div id="outline-container-orgb1f4fb5" class="outline-5">
<h5 id="orgb1f4fb5"><span class="section-number-5">3.5.2.1</span> Using Principle of Deferred Decision (PDD) for node discovery</h5>
<div class="outline-text-5" id="text-3-5-2-1">
<p>
Flip coin to choose next node (amongst connected and not already checked nodes)
</p>
<ul class="org-ul">
<li>Three types of node:
<ul class="org-ul">
<li>Potential, could be in the component</li>
<li>Active, is in the component, edges not checked</li>
<li>saturated, in the component and edges already checked</li>
</ul></li>
<li>\(k\) th step:
<ul class="org-ul">
<li>\(A_k\): # active</li>
<li>\(k\): # saturated (used)</li>
<li>\(n-k-A_k\): # potential</li>
</ul></li>
<li>Number of new active nodes from old active node:
<ul class="org-ul">
<li>\(X_k \sim \text{Binom}(n-k-A_k,p)\)</li>
<li>Indep.</li>
</ul></li>
<li>Approximation: while \(k\) and \(A_k << n\): \(\text{Binom}(n-k-A_k,p) \simeq
  \text{Binom}(n,p)\)</li>
<li>Termination: if E[# offspring] &gt; 1; then P[termination] &lt; 1; if E[# offspring]
&lt; 1, then P[termination] = 1</li>
</ul>
</div>
</div>

<div id="outline-container-org8b5448d" class="outline-5">
<h5 id="org8b5448d"><span class="section-number-5">3.5.2.2</span> Condition for GC in \(G(n,p)\)</h5>
<div class="outline-text-5" id="text-3-5-2-2">
<ul class="org-ul">
<li>Set \(p=\frac{c}{n}\)
<ul class="org-ul">
<li>\(c\): average degree</li>
<li>Number of offspring \(\sim\) Poisson(\(c\))</li>
</ul></li>
<li>Theorem:
<ul class="org-ul">
<li>if \(c > 1\), then \(G(n,p)\) has a single component of size \(\Theta(n)\)
asymptotically almost surely; all other components are small (of size
\(o(n)\))</li>
<li>if \(c < 1\), then \(G(n,p)\) has only small components</li>
</ul></li>
<li>Interpretation:
<ul class="org-ul">
<li>Giant component emerges naturally, even with completely random edge
generation</li>
<li>No network-wide “coordination” needed</li>
<li>Sharp threshold – phase transition! At avg degree c = 1</li>
</ul></li>
<li>Note:
<ul class="org-ul">
<li>More to prove: single component; impact of ignoring \(k + A_k\)</li>
<li>Below threshold (c &lt; 1): all small components are trees</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org82f3e37" class="outline-5">
<h5 id="org82f3e37"><span class="section-number-5">3.5.2.3</span> \(G(n,p)\) model: connectivity</h5>
<div class="outline-text-5" id="text-3-5-2-3">
<ul class="org-ul">
<li>Another phase transition: Consider threshold function \(t(n) = \frac{\log n}{n}\)</li>
<li>Theorem:
<ul class="org-ul">
<li>If \(p(n)/t(n) \to \infty\), then \(G(n, p)\) is connected (a.a.s.)</li>
<li>If \(p(n)/t(n) \to 0\), then \(G(n, p)\) is not connected (a.a.s.)</li>
<li>Gap between these two &rarr; harder to analyze</li>
</ul></li>
<li>Intuition: <a href="https://en.wikipedia.org/wiki/Coupon_collector's_problem">Coupon collector problem</a>: \(n \log n\) balls needed to have no empty
bins</li>
</ul>
</div>
</div>
</div>
</div>
