internetAnalytics.org
** Clustering

- Clustering = transitivity, two nodes with common neighbor likely to be
  connected
- Clustering coefficient = # links among friends / # possible links among
  friends = empirical probability that $(v,w)$ exists given $(u,v)$ and $(u,w)$
  exist
- If links were entirely random:
  - $c_u=p=\frac{m}{\binom{n}{2}} \simeq \frac{2m}{n^2}$, where $m$ = # edges in
    network
  - So $c_u >> p$ means the network has high clustering

*** Network metrics

- Average clustering coefficient: $c_G = \frac{1}{n} \sum_u c_u$
- Weighted average clustering coefficient (also called "transitivity"):
$$c_G = \frac{\sum_u \binom{d_u}{2}c_u}{\sum_u \binom{d_u}{2}} = \frac{\text{#
closed triples}}{\text{# connected triples}} = 3 \frac{\text{#
triangles}}{\text{# connected triples}}$$

** Strong and weak ties

Now edges have propery: "Strong" = close person, "weak" = acquaintances

*** Bridges

- Bridge, removing it disconnects two components
- Local bridge, makes distance big, no more common neighbors

*** Strong Triadic Closure (STC) node property

A node a violates [[https://en.wikipedia.org/wiki/Triadic_closure][STC]] if there are two strong edges $(a, b)$ and $(a, c)$, but there
is no edge $(b, c)$

*** STC \Rightarrow local bridges are weak ties

- Lemma: if a node $a$ satisfies STC (and has at least two strong ties), then
  any local bridge $(a,b)$ is weak.
- Proof:
  - Assume node a satisfies STC, but $(a, b)$ is strong and local bridge
  - By assumption, there is at least one other strong tie $(a, c)$
  - By STC, $(b, c)$ must exist
  - But then $a$ and $b$ have common neighbor $c$, so $(a, b)$ is not a local bridge
  - Contradiction
- Insight: Social ties to communities usually go through weak links

** Short paths

[[https://en.wikipedia.org/wiki/Small-world_experiment][Milgram 1969]]
- Theorem: $G(n,p)$ has diameter $\log(n) / \log(np)$
- Intuition:
  - Graph looke close to a tree from every node
  - Randomness creates very "efficient" graphs (edges used very well to reach
    large number of nodes + few short cycle, incl. triangles)

*** Evolution of average distance with shortcuts

- Average distance on a circle: $cn$, where $c$ is a constant
- Average distance with one "ideal" shortcut $cn/2$
- With $k$ shortcuts $O(\frac{n}{2^k})$
- Distance drops quickly with $k$

*** Evolution of clustering coeff with shortcuts

- As long as $k << n$, small impact on clustering coefficient, few triangles get
  destroyed

*** Small worlds

- high clustering
- small distances

* Lecture 3
** Herding and "watching thy neighbor"

- Information cascades: why imitating your friends makes sense – and how it can lead to surprising group behavior
- Heavy-tailed degree distributions: “the rich get richer” applied to networks

** Watching thy Neighbor

- Human decision-making:
  - Primary private information...
  - Heavily influenced by what decisions taken by others
- Reason:
  - Primary information: often too voluminous, noisy, not trustworthy,...
  - By imitating others, piggyback on their effort to interpret primary information
- Question: Macro behavior of such systems?

** Herding how it can go wrong? Urn model

- Urn with 3 balls
  - A priori distribution (blue/red majority) = (0.5,0.5)
  - majority blue: 2 blue + 1 red
  - majority red: 2 red + 1 blue
- A group of people take turns:
  - Draw a ball from the urn at random
  - Check the color of the ball privately, put it back in urn
  - Announce their guess (blue/red majority) to everybody
- Assumption:
  1. Each individual is altruistic: do what allows others to make best guess
  2. Each individual is selfish = tries to make best guess for himself

*** Urn model: altruistic

- Every person:
  - Selects a ball at random (with replacement)
  - Announces the color of the ball to everybody
- As $n \to \infty$, majority color of urn is equal to color most frequently observed
  - Consequence of law of large numbers
- After a few “sacrifices”, everybody could produce best guess
  - Sacrifice in the sense that first few individuals might be forced to say red
    (color of their ball) even if previous information suggests blue majority

*** Urn model: selfish

- Sequential decision-making
  - Public guess – goal: correct guess for many/most people
  - Observed color remains private
- First individual:
  - Blue ball: announce guess(1) = blue
  - Red ball: announce guess(1) = red
  - Public guess of first fully reveals private information
- Second individual:
  - If color(2) = guess(1): announce this color
  - If color(2) ≠ guess(1): does not matter (assume color(2))
  - Public guess of second fully reveals private information
- Third individual:
  - if guess(1) ≠ guess(2): announce guess(3) = color(3)
  - If guess(1) = guess(2): Announce guess(3)=guess(2)=guess(1), regardless of color(3)
  - Why is this?
    - Person 3 knows that guesses 1+2 reveal perfect information
    - Therefore, regardless of color(3), guess(1)=guess(2) dominates guess
- Fourth,...,∞th individual:
  - If guess(1) = guess(2): Announce guess(i) = guess(2)=guess(1), regardless of
    color(i)
This model leads to cascade
- If guess(1) = guess(2) were both wrong, then all future guesses are wrong!
- This happens with prob. 1/9
- Even though each individual is using available information in the best way to make a guess
- Can show that in this model, this is sure to happen eventually (even if not
  for 3 rd individual)

