internetAnalytics.html

<div id="outline-container-orgd4c4917" class="outline-3">
<h3 id="orgd4c4917"><span class="section-number-3">3.6</span> Clustering</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>Clustering = transitivity, two nodes with common neighbor likely to be
connected</li>
<li>Clustering coefficient = # links among friends / # possible links among
friends = empirical probability that \((v,w)\) exists given \((u,v)\) and \((u,w)\)
exist</li>
<li>If links were entirely random:
<ul class="org-ul">
<li>\(c_u=p=\frac{m}{\binom{n}{2}} \simeq \frac{2m}{n^2}\), where \(m\) = # edges in
network</li>
<li>So \(c_u >> p\) means the network has high clustering</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org0353ed2" class="outline-4">
<h4 id="org0353ed2"><span class="section-number-4">3.6.1</span> Network metrics</h4>
<div class="outline-text-4" id="text-3-6-1">
<ul class="org-ul">
<li>Average clustering coefficient: \(c_G = \frac{1}{n} \sum_u c_u\)</li>
<li>Weighted average clustering coefficient (also called "transitivity"):</li>
</ul>
<p>
\[c_G = \frac{\sum_u \binom{d_u}{2}c_u}{\sum_u \binom{d_u}{2}} = \frac{\text{#
closed triples}}{\text{# connected triples}} = 3 \frac{\text{#
triangles}}{\text{# connected triples}}\]
</p>
</div>
</div>
</div>

<div id="outline-container-org883fcdd" class="outline-3">
<h3 id="org883fcdd"><span class="section-number-3">3.7</span> Strong and weak ties</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Now edges have propery: "Strong" = close person, "weak" = acquaintances
</p>
</div>

<div id="outline-container-orge9a8abe" class="outline-4">
<h4 id="orge9a8abe"><span class="section-number-4">3.7.1</span> Bridges</h4>
<div class="outline-text-4" id="text-3-7-1">
<ul class="org-ul">
<li>Bridge, removing it disconnects two components</li>
<li>Local bridge, makes distance big, no more common neighbors</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfb8ba0" class="outline-4">
<h4 id="orgcfb8ba0"><span class="section-number-4">3.7.2</span> Strong Triadic Closure (STC) node property</h4>
<div class="outline-text-4" id="text-3-7-2">
<p>
A node a violates <a href="https://en.wikipedia.org/wiki/Triadic_closure">STC</a> if there are two strong edges \((a, b)\) and \((a, c)\), but there
is no edge \((b, c)\)
</p>
</div>
</div>

<div id="outline-container-orgc1771bb" class="outline-4">
<h4 id="orgc1771bb"><span class="section-number-4">3.7.3</span> STC &rArr; local bridges are weak ties</h4>
<div class="outline-text-4" id="text-3-7-3">
<ul class="org-ul">
<li>Lemma: if a node \(a\) satisfies STC (and has at least two strong ties), then
any local bridge \((a,b)\) is weak.</li>
<li>Proof:
<ul class="org-ul">
<li>Assume node a satisfies STC, but \((a, b)\) is strong and local bridge</li>
<li>By assumption, there is at least one other strong tie \((a, c)\)</li>
<li>By STC, \((b, c)\) must exist</li>
<li>But then \(a\) and \(b\) have common neighbor \(c\), so \((a, b)\) is not a local bridge</li>
<li>Contradiction</li>
</ul></li>
<li>Insight: Social ties to communities usually go through weak links</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org361e6d2" class="outline-3">
<h3 id="org361e6d2"><span class="section-number-3">3.8</span> Short paths</h3>
<div class="outline-text-3" id="text-3-8">
<p>
<a href="https://en.wikipedia.org/wiki/Small-world_experiment">Milgram 1969</a>
</p>
<ul class="org-ul">
<li>Theorem: \(G(n,p)\) has diameter \(\log(n) / \log(np)\)</li>
<li>Intuition:
<ul class="org-ul">
<li>Graph looke close to a tree from every node</li>
<li>Randomness creates very "efficient" graphs (edges used very well to reach
large number of nodes + few short cycle, incl. triangles)</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org89eb35a" class="outline-4">
<h4 id="org89eb35a"><span class="section-number-4">3.8.1</span> Evolution of average distance with shortcuts</h4>
<div class="outline-text-4" id="text-3-8-1">
<ul class="org-ul">
<li>Average distance on a circle: \(cn\), where \(c\) is a constant</li>
<li>Average distance with one "ideal" shortcut \(cn/2\)</li>
<li>With \(k\) shortcuts \(O(\frac{n}{2^k})\)</li>
<li>Distance drops quickly with \(k\)</li>
</ul>
</div>
</div>

<div id="outline-container-org83c3568" class="outline-4">
<h4 id="org83c3568"><span class="section-number-4">3.8.2</span> Evolution of clustering coeff with shortcuts</h4>
<div class="outline-text-4" id="text-3-8-2">
<ul class="org-ul">
<li>As long as \(k << n\), small impact on clustering coefficient, few triangles get
destroyed</li>
</ul>
</div>
</div>

<div id="outline-container-org55ec833" class="outline-4">
<h4 id="org55ec833"><span class="section-number-4">3.8.3</span> Small worlds</h4>
<div class="outline-text-4" id="text-3-8-3">
<ul class="org-ul">
<li>high clustering</li>
<li>small distances</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org19c334e" class="outline-2">
<h2 id="org19c334e"><span class="section-number-2">4</span> Lecture 3</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgf3b6055" class="outline-3">
<h3 id="orgf3b6055"><span class="section-number-3">4.1</span> Herding and "watching thy neighbor"</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Information cascades: why imitating your friends makes sense – and how it can lead to surprising group behavior</li>
<li>Heavy-tailed degree distributions: “the rich get richer” applied to networks</li>
</ul>
</div>
</div>

<div id="outline-container-orgb06cc47" class="outline-3">
<h3 id="orgb06cc47"><span class="section-number-3">4.2</span> Watching thy Neighbor</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Human decision-making:
<ul class="org-ul">
<li>Primary private information&#x2026;</li>
<li>Heavily influenced by what decisions taken by others</li>
</ul></li>
<li>Reason:
<ul class="org-ul">
<li>Primary information: often too voluminous, noisy, not trustworthy,&#x2026;</li>
<li>By imitating others, piggyback on their effort to interpret primary information</li>
</ul></li>
<li>Question: Macro behavior of such systems?</li>
</ul>
</div>
</div>

<div id="outline-container-orgbb69a61" class="outline-3">
<h3 id="orgbb69a61"><span class="section-number-3">4.3</span> Herding how it can go wrong? Urn model</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Urn with 3 balls
<ul class="org-ul">
<li>A priori distribution (blue/red majority) = (0.5,0.5)</li>
<li>majority blue: 2 blue + 1 red</li>
<li>majority red: 2 red + 1 blue</li>
</ul></li>
<li>A group of people take turns:
<ul class="org-ul">
<li>Draw a ball from the urn at random</li>
<li>Check the color of the ball privately, put it back in urn</li>
<li>Announce their guess (blue/red majority) to everybody</li>
</ul></li>
<li>Assumption:
<ol class="org-ol">
<li>Each individual is altruistic: do what allows others to make best guess</li>
<li>Each individual is selfish = tries to make best guess for himself</li>
</ol></li>
</ul>
</div>

<div id="outline-container-orgc1e3033" class="outline-4">
<h4 id="orgc1e3033"><span class="section-number-4">4.3.1</span> Urn model: altruistic</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li>Every person:
<ul class="org-ul">
<li>Selects a ball at random (with replacement)</li>
<li>Announces the color of the ball to everybody</li>
</ul></li>
<li>As \(n \to \infty\), majority color of urn is equal to color most frequently observed
<ul class="org-ul">
<li>Consequence of law of large numbers</li>
</ul></li>
<li>After a few “sacrifices”, everybody could produce best guess
<ul class="org-ul">
<li>Sacrifice in the sense that first few individuals might be forced to say red
(color of their ball) even if previous information suggests blue majority</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd0488d7" class="outline-4">
<h4 id="orgd0488d7"><span class="section-number-4">4.3.2</span> Urn model: selfish</h4>
<div class="outline-text-4" id="text-4-3-2">
<ul class="org-ul">
<li>Sequential decision-making
<ul class="org-ul">
<li>Public guess – goal: correct guess for many/most people</li>
<li>Observed color remains private</li>
</ul></li>
<li>First individual:
<ul class="org-ul">
<li>Blue ball: announce guess(1) = blue</li>
<li>Red ball: announce guess(1) = red</li>
<li>Public guess of first fully reveals private information</li>
</ul></li>
<li>Second individual:
<ul class="org-ul">
<li>If color(2) = guess(1): announce this color</li>
<li>If color(2) ≠ guess(1): does not matter (assume color(2))</li>
<li>Public guess of second fully reveals private information</li>
</ul></li>
<li>Third individual:
<ul class="org-ul">
<li>if guess(1) ≠ guess(2): announce guess(3) = color(3)</li>
<li>If guess(1) = guess(2): Announce guess(3)=guess(2)=guess(1), regardless of color(3)</li>
<li>Why is this?
<ul class="org-ul">
<li>Person 3 knows that guesses 1+2 reveal perfect information</li>
<li>Therefore, regardless of color(3), guess(1)=guess(2) dominates guess</li>
</ul></li>
</ul></li>
<li>Fourth,&#x2026;,∞th individual:
<ul class="org-ul">
<li>If guess(1) = guess(2): Announce guess(i) = guess(2)=guess(1), regardless of
color(i)</li>
</ul></li>
</ul>
<p>
This model leads to cascade
</p>
<ul class="org-ul">
<li>If guess(1) = guess(2) were both wrong, then all future guesses are wrong!</li>
<li>This happens with prob. 1/9</li>
<li>Even though each individual is using available information in the best way to make a guess</li>
<li>Can show that in this model, this is sure to happen eventually (even if not
for 3 rd individual)</li>
</ul>
</div>
</div>
