internetAnalytics.org
*** Information cascade: suboptimal decision

- Cascade: sequential decisions
- Individual:
  - Efficiency gain by observing others’ decisions
- Global behavior:
  - Primary information can “wash out”
  - Suboptimal or random decisions
- Might these be cascades:
  - Stock market gyrations, “flash crash”
  - Inexplicable shifts in popularity of {restaurants, clubs, celebrities,...}
  - Fashion, style, celebrity,...
  - ...

** Herding in networks

- Observation: degree distributions in networks often resemble power laws
- Power law: $P(D > d) \propto d^{-\gamma}$
- Must distributions have "light tails": eg. $P(D > d) \propto e^{0\alpha d}$
Example of such distribution: [[https://en.wikipedia.org/wiki/Pareto_distribution][Pareto distribution]] 

Useful to compare the tail of the distribution, what is d* s.t P(D > d*) = 10^-9

** Preferential attachment in growing nets

- Growth model: nodes arrive one by one and join the existing network
  - Directed graph
  - In-degree $d_{in{(v)$ measures "popularity" and attractiveness" of node
- Preferential attachment: new node creates one edge
- Prob. of connecting to $v$ is $\propto d_{in}(v)$
- Intuition: high-degree easier to meet; more popular; more useful;...
- Node with in-degree 0 never gets “started”
- Need another assumption:
  - With prob. $\alpha$, new node connects uniformly at random
  - With prob. $1 - \alpha$ , preferential attachment

*** Analysis

cf. slides for details.

** Observing
*** [[https://en.wikipedia.org/wiki/Friendship_paradox][Friendship Paradox]]

- “Your friends have more friends than you”
- Social network = $G(V,E)$
- $d_v$ : degree of node $v$
- $n = |V|$ : number of nodes, $m = |E|$ : number of edges
- Average number of friends: $\mu = \frac{\sum d_v}{n}$
- How to talk about average number of friends’ friends?
  - Average degree over nodes: $\mu = \frac{\sum d_v}{n} = 2 \frac{m}{n}$, look at each person
  - Average degree over edges: $\frac{\sum_{(u,v)\in E} d_v}{2m}$, look at each person's list of friends
- Lemma:
  - $\frac{\sum_{(u,v)\in E} d_v}{2m} = \mu\left(1+\frac{\sigma^2}{\mu^2}\right)$
  - Degree variance: $\sigma^2 = \frac{1}{n} \sum_{v\in V} d^2_v - \left(\frac{1}{n} \sum_{v\in V} d_v\right)^2$

*** Observer matters

Sampling bias

* Lecture 4
** Node statistics in large networks

- Breadth-First Search
  - Problem: “locality bias”
  - E.g.: starting node is a page in English \to most nearby pages probably are as well
- Depth-First Search
  - Advantage: avoid locality bias
  - Problem: bias in ordering of links
  - E.g.: suppose FB friends listed alphabetically -> only visit people named
    “A*"
- Node sampling
  - Urn model: select every node with prob. 1/n indep. with replacement; compute
    average over many samples
  - Problem: usually not available, because we only have “neighbors of current
    node”!

** Random walks on graphs

- Random Walk
  - Advantage: no ordering bias (by def); no locality bias (under some conditions)
  - A bit like DFS with shuffled neighbors (but RW can return)
- Undirected graph $G(V,E)$
- Assume connected (otherwise assume G is the GC for the actual network)
  - Random Walk:
    + Discrete time $t$
    + Node at time $t$: $X_t$
    + At each time step, go to a neighbor of $X_t$ uniformly at random \to
      $X_{t+1}$
Problem, bias: high-degree nodes sampled more frequently

*** Random walks as Markov chain

- Transition matrix $P$:
$$P= \begin{cases}
p_{ij} = 1/d_i & (i,j) \in E\\
0 & \text{otherwise}
\end{cases}$$
- If $G(V, E)$ is undirected, connected and non-bipartite, then $\lbrace X_t
  \rbrace$ is an ergodic (irreducible, aperiodic) Markov chain
(Ergodicity: Stationary distribution $\pi$, $p_{ij}(t) \to \pi_j$

*** Stationary distribution \pi

- Lemma: $\pi \propto [d_1 , d_2 , \dots , d_n ]$
- Proof:
  - Def of stationary distribution: $\pi = \pi P$
  - [d_1 , d_2 , d_3 , \dots , d_n] P = x
  - $x_j = \sum_i d_i p_{ij} = \sum_i 1_{\lbrace(i,j) \in E \rbrace} = d_j$
  - $[d_1 , \dots , d_n]$ is eigenvector with eigenvalue=1 \to stationary distribution
Intuition:
- Random walk “sees” uniformly random edges; nodes biased by # of edges = degree
- Similar to Friendship Paradox!

*** Obtaining unbiased estimator from RW

- Node statistic $f(i)$
- Would like to know $F = \frac{1}{n} \sum_{v\in V} f(v)$
- Sampling:
  - Ideal: $P(X_t = v) = \frac{1}{n}$
  - RW: $P(X_t = v) = \frac{d_v}{||d||_1} = \frac{d_v}{2m}$
- Compensate for degree bias:
  - Let RW run for $T$ time steps
  - Compute $\hat{F} = \frac{2m \sum_t f(X_t)/d_{X_t}}{nT}$
- Stationary regime: unbiased $E[\hat{F}] = E[f(X_t)] = F$, but we cannot start
  in stationary regime, instead at a specific state \to how large does $T$ have
  to be?

*** Estimator without knowledge of $n,m$

- In practice, we may not know $n, m$
- Eliminate from estimate:
  - Can estimate normalization constant from sample path
  - $\hat{F} = \frac{\sum_t f(X_t)/d_{X_t}}{\sum_t 1/d_{X_t}}$
  - Denominator: sum of all (random) weights

*** Spectral theorem applied to RW

- Want to compute powers of $P$: $p_{ij}(t) = [P^t]_{ij}$: $P$(at $j$ after $t$
  steps|starting at $i$)
- Spectral decomposition: But P is not symmetric
- Work with a “symmetrized” version of P
  - Def: D =diag(\frac{1}{d_1},\dots, \frac{1}{d_n})
  - Def: A = adjacency matrix
  - N = D1/2 AD1/2 = D −1/2 PD1/2
  - Symmetric \to spectral form: $N = \sum_{k=1}^n \lambda_k v_k v_k^T$
  - $\lambda k$ : eigenvalues
  - $v_k$ : normalized eigenvectors
- $p_{ij}(t) = [P^t]_{ij} = \pi_j + \sum_{k=2}^n \lambda_k^t \nu_{ki}\nu_{kj}
  \sqrt{\frac{d_j}{d_i}}$

*** Conductance
** Epidemics
* Lecture 5
