internetAnalytics.html

<div id="outline-container-orgbccfb4a" class="outline-4">
<h4 id="orgbccfb4a"><span class="section-number-4">4.3.3</span> Information cascade: suboptimal decision</h4>
<div class="outline-text-4" id="text-4-3-3">
<ul class="org-ul">
<li>Cascade: sequential decisions</li>
<li>Individual:
<ul class="org-ul">
<li>Efficiency gain by observing others’ decisions</li>
</ul></li>
<li>Global behavior:
<ul class="org-ul">
<li>Primary information can “wash out”</li>
<li>Suboptimal or random decisions</li>
</ul></li>
<li>Might these be cascades:
<ul class="org-ul">
<li>Stock market gyrations, “flash crash”</li>
<li>Inexplicable shifts in popularity of {restaurants, clubs, celebrities,&#x2026;}</li>
<li>Fashion, style, celebrity,&#x2026;</li>
<li>&#x2026;</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga078e9a" class="outline-3">
<h3 id="orga078e9a"><span class="section-number-3">4.4</span> Herding in networks</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Observation: degree distributions in networks often resemble power laws</li>
<li>Power law: \(P(D > d) \propto d^{-\gamma}\)</li>
<li>Must distributions have "light tails": eg. \(P(D > d) \propto e^{0\alpha d}\)</li>
</ul>
<p>
Example of such distribution: <a href="https://en.wikipedia.org/wiki/Pareto_distribution">Pareto distribution</a> 
</p>

<p>
Useful to compare the tail of the distribution, what is d* s.t P(D &gt; d*) = 10<sup>-9</sup>
</p>
</div>
</div>

<div id="outline-container-org7ed2929" class="outline-3">
<h3 id="org7ed2929"><span class="section-number-3">4.5</span> Preferential attachment in growing nets</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>Growth model: nodes arrive one by one and join the existing network
<ul class="org-ul">
<li>Directed graph</li>
<li>In-degree \(d_{in{(v)\) measures "popularity" and attractiveness" of node</li>
</ul></li>
<li>Preferential attachment: new node creates one edge</li>
<li>Prob. of connecting to \(v\) is \(\propto d_{in}(v)\)</li>
<li>Intuition: high-degree easier to meet; more popular; more useful;&#x2026;</li>
<li>Node with in-degree 0 never gets “started”</li>
<li>Need another assumption:
<ul class="org-ul">
<li>With prob. \(\alpha\), new node connects uniformly at random</li>
<li>With prob. \(1 - \alpha\) , preferential attachment</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org899407c" class="outline-4">
<h4 id="org899407c"><span class="section-number-4">4.5.1</span> Analysis</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
cf. slides for details.
</p>
</div>
</div>
</div>

<div id="outline-container-org8530906" class="outline-3">
<h3 id="org8530906"><span class="section-number-3">4.6</span> Observing</h3>
<div class="outline-text-3" id="text-4-6">
</div><div id="outline-container-org74dee9b" class="outline-4">
<h4 id="org74dee9b"><span class="section-number-4">4.6.1</span> <a href="https://en.wikipedia.org/wiki/Friendship_paradox">Friendship Paradox</a></h4>
<div class="outline-text-4" id="text-4-6-1">
<ul class="org-ul">
<li>“Your friends have more friends than you”</li>
<li>Social network = \(G(V,E)\)</li>
<li>\(d_v\) : degree of node \(v\)</li>
<li>\(n = |V|\) : number of nodes, \(m = |E|\) : number of edges</li>
<li>Average number of friends: \(\mu = \frac{\sum d_v}{n}\)</li>
<li>How to talk about average number of friends’ friends?
<ul class="org-ul">
<li>Average degree over nodes: \(\mu = \frac{\sum d_v}{n} = 2 \frac{m}{n}\), look at each person</li>
<li>Average degree over edges: \(\frac{\sum_{(u,v)\in E} d_v}{2m}\), look at each person's list of friends</li>
</ul></li>
<li>Lemma:
<ul class="org-ul">
<li>\(\frac{\sum_{(u,v)\in E} d_v}{2m} = \mu\left(1+\frac{\sigma^2}{\mu^2}\right)\)</li>
<li>Degree variance: \(\sigma^2 = \frac{1}{n} \sum_{v\in V} d^2_v - \left(\frac{1}{n} \sum_{v\in V} d_v\right)^2\)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org769c15d" class="outline-4">
<h4 id="org769c15d"><span class="section-number-4">4.6.2</span> Observer matters</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
Sampling bias
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org3c5c58c" class="outline-2">
<h2 id="org3c5c58c"><span class="section-number-2">5</span> Lecture 4</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org407c339" class="outline-3">
<h3 id="org407c339"><span class="section-number-3">5.1</span> Node statistics in large networks</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Breadth-First Search
<ul class="org-ul">
<li>Problem: “locality bias”</li>
<li>E.g.: starting node is a page in English &rarr; most nearby pages probably are as well</li>
</ul></li>
<li>Depth-First Search
<ul class="org-ul">
<li>Advantage: avoid locality bias</li>
<li>Problem: bias in ordering of links</li>
<li>E.g.: suppose FB friends listed alphabetically -&gt; only visit people named
“A*"</li>
</ul></li>
<li>Node sampling
<ul class="org-ul">
<li>Urn model: select every node with prob. 1/n indep. with replacement; compute
average over many samples</li>
<li>Problem: usually not available, because we only have “neighbors of current
node”!</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf127015" class="outline-3">
<h3 id="orgf127015"><span class="section-number-3">5.2</span> Random walks on graphs</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Random Walk
<ul class="org-ul">
<li>Advantage: no ordering bias (by def); no locality bias (under some conditions)</li>
<li>A bit like DFS with shuffled neighbors (but RW can return)</li>
</ul></li>
<li>Undirected graph \(G(V,E)\)</li>
<li>Assume connected (otherwise assume G is the GC for the actual network)
<ul class="org-ul">
<li>Random Walk:
<ul class="org-ul">
<li>Discrete time \(t\)</li>
<li>Node at time \(t\): \(X_t\)</li>
<li>At each time step, go to a neighbor of \(X_t\) uniformly at random &rarr;
\(X_{t+1}\)</li>
</ul></li>
</ul></li>
</ul>
<p>
Problem, bias: high-degree nodes sampled more frequently
</p>
</div>

<div id="outline-container-org1240bec" class="outline-4">
<h4 id="org1240bec"><span class="section-number-4">5.2.1</span> Random walks as Markov chain</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>Transition matrix \(P\):</li>
</ul>
<p>
\[P= \begin{cases}
p_{ij} = 1/d_i & (i,j) \in E\\
0 & \text{otherwise}
\end{cases}\]
</p>
<ul class="org-ul">
<li>If \(G(V, E)\) is undirected, connected and non-bipartite, then \(\lbrace X_t
  \rbrace\) is an ergodic (irreducible, aperiodic) Markov chain</li>
</ul>
<p>
(Ergodicity: Stationary distribution \(\pi\), \(p_{ij}(t) \to \pi_j\)
</p>
</div>
</div>

<div id="outline-container-org94fb40b" class="outline-4">
<h4 id="org94fb40b"><span class="section-number-4">5.2.2</span> Stationary distribution &pi;</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>Lemma: \(\pi \propto [d_1 , d_2 , \dots , d_n ]\)</li>
<li>Proof:
<ul class="org-ul">
<li>Def of stationary distribution: \(\pi = \pi P\)</li>
<li>[d<sub>1</sub> , d<sub>2</sub> , d<sub>3</sub> , &hellip; , d<sub>n</sub>] P = x</li>
<li>\(x_j = \sum_i d_i p_{ij} = \sum_i 1_{\lbrace(i,j) \in E \rbrace} = d_j\)</li>
<li>\([d_1 , \dots , d_n]\) is eigenvector with eigenvalue=1 &rarr; stationary distribution</li>
</ul></li>
</ul>
<p>
Intuition:
</p>
<ul class="org-ul">
<li>Random walk “sees” uniformly random edges; nodes biased by # of edges = degree</li>
<li>Similar to Friendship Paradox!</li>
</ul>
</div>
</div>

<div id="outline-container-org3c90ad6" class="outline-4">
<h4 id="org3c90ad6"><span class="section-number-4">5.2.3</span> Obtaining unbiased estimator from RW</h4>
<div class="outline-text-4" id="text-5-2-3">
<ul class="org-ul">
<li>Node statistic \(f(i)\)</li>
<li>Would like to know \(F = \frac{1}{n} \sum_{v\in V} f(v)\)</li>
<li>Sampling:
<ul class="org-ul">
<li>Ideal: \(P(X_t = v) = \frac{1}{n}\)</li>
<li>RW: \(P(X_t = v) = \frac{d_v}{||d||_1} = \frac{d_v}{2m}\)</li>
</ul></li>
<li>Compensate for degree bias:
<ul class="org-ul">
<li>Let RW run for \(T\) time steps</li>
<li>Compute \(\hat{F} = \frac{2m \sum_t f(X_t)/d_{X_t}}{nT}\)</li>
</ul></li>
<li>Stationary regime: unbiased \(E[\hat{F}] = E[f(X_t)] = F\), but we cannot start
in stationary regime, instead at a specific state &rarr; how large does \(T\) have
to be?</li>
</ul>
</div>
</div>

<div id="outline-container-org52eac06" class="outline-4">
<h4 id="org52eac06"><span class="section-number-4">5.2.4</span> Estimator without knowledge of \(n,m\)</h4>
<div class="outline-text-4" id="text-5-2-4">
<ul class="org-ul">
<li>In practice, we may not know \(n, m\)</li>
<li>Eliminate from estimate:
<ul class="org-ul">
<li>Can estimate normalization constant from sample path</li>
<li>\(\hat{F} = \frac{\sum_t f(X_t)/d_{X_t}}{\sum_t 1/d_{X_t}}\)</li>
<li>Denominator: sum of all (random) weights</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf921919" class="outline-4">
<h4 id="orgf921919"><span class="section-number-4">5.2.5</span> Spectral theorem applied to RW</h4>
<div class="outline-text-4" id="text-5-2-5">
<ul class="org-ul">
<li>Want to compute powers of \(P\): \(p_{ij}(t) = [P^t]_{ij}\): \(P\)(at \(j\) after \(t\)
steps|starting at \(i\))</li>
<li>Spectral decomposition: But P is not symmetric</li>
<li>Work with a “symmetrized” version of P
<ul class="org-ul">
<li>Def: D =diag(\frac{1}{d_1},&hellip;, \frac{1}{d_n})</li>
<li>Def: A = adjacency matrix</li>
<li>N = D1/2 AD1/2 = D −1/2 PD1/2</li>
<li>Symmetric &rarr; spectral form: \(N = \sum_{k=1}^n \lambda_k v_k v_k^T\)</li>
<li>\(\lambda k\) : eigenvalues</li>
<li>\(v_k\) : normalized eigenvectors</li>
</ul></li>
<li>\(p_{ij}(t) = [P^t]_{ij} = \pi_j + \sum_{k=2}^n \lambda_k^t \nu_{ki}\nu_{kj}
  \sqrt{\frac{d_j}{d_i}}\)</li>
</ul>
</div>
</div>
