internetAnalytics.org
** Structure of the web
One dominant giant strongly connected component.
** Search \to Ranking
- Search query \to ranked list of results
- Two ingredients:
  - Relevance score: how relevant is the result to the query (cf retrieval lectures)
  - Importance score: quality, importance of the result independent of query
*** Hyperlink: intuition
Links are asymmetric
- Existence under control of link tail
  - Means “X considers Y relevant”
  - Does not necessarily mean “quality” or “agreement”
- Represented as directed graph
*** Turning hyperlink net into ranking
- Importance score of page $u:$ $\pi_u$
- Approach 1: $\pi_u = i_u$ (in-degree)
  - More endorsements = more important
  - Problem: easy to spam (e.g., link-farm)
- Approach 2: take into account importance of endorser \to circular
  - $\pi = \sum_{(v,u)}\pi_v$
  - More important endorsers = more important
  - Problem: a page pointing to a single other page should be stronger endorsement
    than e.g. a long list of links
Approach 3:
$$\pi_u = \sum_{(v,u)} \frac{\pi_v}{o_v}$$
*** Score-flow matrix $H$
- Def: $H_{uv} = \begin{cases} \frac{1}{o_u} & (u,v) \in E \\
0 & \text{otherwise}
\end{cases}$
- Note: $H$ is the transition matrix of a RW on the web
  - "Random surfer": $P(\text{at }v\text{ at time }t+1) = \sum_u P(\text{at
    }u\text{ at time }t)/o_u$
  - $\pi_{t+1} = \pi_t H$
- If RW is ergodic, then $\pi_t \to \pi$
  - $\pi = \pi H$, i.e., solves the score-flow equation
  - Condition for ergodicity: graph has to be non-periodic and strongly connected
    \to aperiodic and irreducible Markov chain
*** Dangling nodes
Dangling node = absorbing state of RW (not strongly connected)

\Rightarrow There is no (non-zero) $\pi$ that solves $\pi = \pi H$
*** Dealing with dangling nodes
- Idea: if random surfer arrives at dangling node \to go to any webpage uniformly at random
  - Or following some well-chosen distribution a over all nodes
- Def: $w=$indicator of dangling nodes, Example: $w = (0,0,0,1)$
- $\hat{H} = H +\frac{1}{n} (w^T e)$ (stochastic matrix)
*** Google Matrix $G$
Can have sets that forms absorbing class or can have several solutions.
**** Solution
Add randomization: at every iteration, coin flip: with prob $\theta$ walk on the
graph $\hat{H}$, with prob. $1-\theta$ jump to a random page.
- $G = \theta \hat{H} = (1-\theta) \frac{e^T e}{n}$, where $e^T e/n$ is called
  the teleportation matrix
- Theorem:
  - if $\theta < 1$, $\pi = \pi G$ has exactly one solution for any network
    graph
  - if $\theta = 0$, then $\pi$ uniform
  - In practice: $0.8 \le \theta \le 0.9$
  - Prob of jumping = geometric
- PageRank algoithm computes this solution
* Lecture 6
** What is dimensionality reduction?
- Often high dimensionality data has also meaning in lower dimension

* Lecture 8
* Tips and tricks
** Stationary distribution of RW

HOW to: compute eigenvectors of P (probability transition matrix), then \pi
where \pi P = P, is the stationary distribution.

* Lab1
** https://github.com/mdeff/python_tour_of_data_science
** Finish lab 1
* Research
** Principle of deffered decision for giant component discovery
** Unbiased estimator for Random Walks
** Mixing time for RW
** Conductance
