internetAnalytics.html

<div id="outline-container-org9d95164" class="outline-4">
<h4 id="org9d95164"><span class="section-number-4">5.2.6</span> Conductance</h4>
</div>
</div>
<div id="outline-container-orga148ca1" class="outline-3">
<h3 id="orga148ca1"><span class="section-number-3">5.3</span> Epidemics</h3>
</div>
</div>
<div id="outline-container-org172dcec" class="outline-2">
<h2 id="org172dcec"><span class="section-number-2">6</span> Lecture 5</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgb26ceea" class="outline-3">
<h3 id="orgb26ceea"><span class="section-number-3">6.1</span> Structure of the web</h3>
<div class="outline-text-3" id="text-6-1">
<p>
One dominant giant strongly connected component.
</p>
</div>
</div>
<div id="outline-container-org6b8235a" class="outline-3">
<h3 id="org6b8235a"><span class="section-number-3">6.2</span> Search &rarr; Ranking</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Search query &rarr; ranked list of results</li>
<li>Two ingredients:
<ul class="org-ul">
<li>Relevance score: how relevant is the result to the query (cf retrieval lectures)</li>
<li>Importance score: quality, importance of the result independent of query</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgb332542" class="outline-4">
<h4 id="orgb332542"><span class="section-number-4">6.2.1</span> Hyperlink: intuition</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
Links are asymmetric
</p>
<ul class="org-ul">
<li>Existence under control of link tail
<ul class="org-ul">
<li>Means “X considers Y relevant”</li>
<li>Does not necessarily mean “quality” or “agreement”</li>
</ul></li>
<li>Represented as directed graph</li>
</ul>
</div>
</div>
<div id="outline-container-org09e781d" class="outline-4">
<h4 id="org09e781d"><span class="section-number-4">6.2.2</span> Turning hyperlink net into ranking</h4>
<div class="outline-text-4" id="text-6-2-2">
<ul class="org-ul">
<li>Importance score of page \(u:\) \(\pi_u\)</li>
<li>Approach 1: \(\pi_u = i_u\) (in-degree)
<ul class="org-ul">
<li>More endorsements = more important</li>
<li>Problem: easy to spam (e.g., link-farm)</li>
</ul></li>
<li>Approach 2: take into account importance of endorser &rarr; circular
<ul class="org-ul">
<li>\(\pi = \sum_{(v,u)}\pi_v\)</li>
<li>More important endorsers = more important</li>
<li>Problem: a page pointing to a single other page should be stronger endorsement
than e.g. a long list of links</li>
</ul></li>
</ul>
<p>
Approach 3:
\[\pi_u = \sum_{(v,u)} \frac{\pi_v}{o_v}\]
</p>
</div>
</div>
<div id="outline-container-org60dd826" class="outline-4">
<h4 id="org60dd826"><span class="section-number-4">6.2.3</span> Score-flow matrix \(H\)</h4>
<div class="outline-text-4" id="text-6-2-3">
<ul class="org-ul">
<li>Def: $H<sub>uv</sub> = \begin{cases} \frac{1}{o_u} &amp; (u,v) &isin; E <br /></li>
</ul>
<p>
0 &amp; \text{otherwise}
\end{cases}$
</p>
<ul class="org-ul">
<li>Note: \(H\) is the transition matrix of a RW on the web
<ul class="org-ul">
<li>"Random surfer": \(P(\text{at }v\text{ at time }t+1) = \sum_u P(\text{at
    }u\text{ at time }t)/o_u\)</li>
<li>\(\pi_{t+1} = \pi_t H\)</li>
</ul></li>
<li>If RW is ergodic, then \(\pi_t \to \pi\)
<ul class="org-ul">
<li>\(\pi = \pi H\), i.e., solves the score-flow equation</li>
<li>Condition for ergodicity: graph has to be non-periodic and strongly connected
&rarr; aperiodic and irreducible Markov chain</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2abf29c" class="outline-4">
<h4 id="org2abf29c"><span class="section-number-4">6.2.4</span> Dangling nodes</h4>
<div class="outline-text-4" id="text-6-2-4">
<p>
Dangling node = absorbing state of RW (not strongly connected)
</p>

<p>
&rArr; There is no (non-zero) \(\pi\) that solves \(\pi = \pi H\)
</p>
</div>
</div>
<div id="outline-container-org53692de" class="outline-4">
<h4 id="org53692de"><span class="section-number-4">6.2.5</span> Dealing with dangling nodes</h4>
<div class="outline-text-4" id="text-6-2-5">
<ul class="org-ul">
<li>Idea: if random surfer arrives at dangling node &rarr; go to any webpage uniformly at random
<ul class="org-ul">
<li>Or following some well-chosen distribution a over all nodes</li>
</ul></li>
<li>Def: $w=$indicator of dangling nodes, Example: \(w = (0,0,0,1)\)</li>
<li>\(\hat{H} = H +\frac{1}{n} (w^T e)\) (stochastic matrix)</li>
</ul>
</div>
</div>
<div id="outline-container-org1107111" class="outline-4">
<h4 id="org1107111"><span class="section-number-4">6.2.6</span> Google Matrix \(G\)</h4>
<div class="outline-text-4" id="text-6-2-6">
<p>
Can have sets that forms absorbing class or can have several solutions.
</p>
</div>
<div id="outline-container-org6537023" class="outline-5">
<h5 id="org6537023"><span class="section-number-5">6.2.6.1</span> Solution</h5>
<div class="outline-text-5" id="text-6-2-6-1">
<p>
Add randomization: at every iteration, coin flip: with prob \(\theta\) walk on the
graph \(\hat{H}\), with prob. \(1-\theta\) jump to a random page.
</p>
<ul class="org-ul">
<li>\(G = \theta \hat{H} = (1-\theta) \frac{e^T e}{n}\), where \(e^T e/n\) is called
the teleportation matrix</li>
<li>Theorem: if \(\theta < 1\), \(\pi = \pi G\) has exactly one solution for any
network graph</li>
<li>PageRank algoithm computes this solution</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org5faf26e" class="outline-2">
<h2 id="org5faf26e"><span class="section-number-2">7</span> Tips and tricks</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgaf054f1" class="outline-3">
<h3 id="orgaf054f1"><span class="section-number-3">7.1</span> Stationary distribution of RW</h3>
<div class="outline-text-3" id="text-7-1">
<p>
HOW to: compute eigenvectors of P (probability transition matrix), then &pi;
where &pi; P = P, is the stationary distribution.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdc28593" class="outline-2">
<h2 id="orgdc28593"><span class="section-number-2">8</span> Lab1</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgc639100" class="outline-3">
<h3 id="orgc639100"><span class="section-number-3">8.1</span> <a href="https://github.com/mdeff/python_tour_of_data_science">https://github.com/mdeff/python_tour_of_data_science</a></h3>
</div>
<div id="outline-container-org07b6129" class="outline-3">
<h3 id="org07b6129"><span class="section-number-3">8.2</span> Finish lab 1</h3>
</div>
</div>
<div id="outline-container-orgc107e10" class="outline-2">
<h2 id="orgc107e10"><span class="section-number-2">9</span> Research</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org986f827" class="outline-3">
<h3 id="org986f827"><span class="section-number-3">9.1</span> Principle of deffered decision for giant component discovery</h3>
</div>
<div id="outline-container-org4c5d72d" class="outline-3">
<h3 id="org4c5d72d"><span class="section-number-3">9.2</span> Unbiased estimator for Random Walks</h3>
</div>
<div id="outline-container-org9dc2a6d" class="outline-3">
<h3 id="org9dc2a6d"><span class="section-number-3">9.3</span> Mixing time for RW</h3>
</div>
<div id="outline-container-org83cc3f8" class="outline-3">
<h3 id="org83cc3f8"><span class="section-number-3">9.4</span> Conductance</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-20 Mon 16:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
